using System;
using System.Text;
using static System.Net.Mime.MediaTypeNames;



using System;

class Program
{
    public static void Main()
    {
        string s = "Містер Дурслі завмер. Його охопив жах. Він озирнувся на тих шептунів, наче хотів їм щось сказати, проте передумав.\r\n\r\nВін перебіг вулицю, поспіхом піднявся до кабінету, гукнув секретарці не турбувати його, схопив телефон і почав набирати свій домашній номер, аж раптом зупинився. Поклав слухавку й замислено погладив вуса. Та ні, яка дурниця. Виходить Поттер — не таке вже й рідкісне прізвище. Є безліч людей, які мають не тільки це прізвище, а й сина на ім'я Гаррі. Так міркуючи, Дурслі вже навіть не знав, чи його племінника справді звуть Гаррі. Він його ніколи й не бачив. Може, то Гарві. Або Гарольд. Не варто хвилювати місіс Дурслі, вона й так дратується на саму згадку про сестру. Він їй не докоряв: якби така сестра була в нього… А все ж оті люди в мантіях…\r\n\r\nТепер Дурслі було значно важче зосередитися на свердлах і, виходячи о п'ятій пополудні з будинку, він був такий неуважний, що наскочив на когось біля самих дверей.";
        int sentences = 0;
        char[] c = s.ToCharArray();
        foreach(char c2 in c)
        {
            Console.WriteLine(s[0]);
            
        }
        bool prev = true;
        foreach (char ch in s)
        {
            bool cur = ch == '.' || ch == '!' || ch == '?';
            if (!prev && cur) sentences++;
            prev = cur;

        }
        Console.WriteLine(sentences);
    }
   

}




